import sqlite3
from datetime import datetime
from telebot import types
from config import *

def init_db():
    conn = sqlite3.connect(DB_NAME)
    c = conn.cursor()
    c.execute('''
        CREATE TABLE IF NOT EXISTS requests (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            user_id INTEGER,
            username TEXT,
            first_name TEXT,
            message TEXT
        )
    ''')
    conn.commit()
    conn.close()

def save_request(user_id, username, first_name, message_text):
    conn = sqlite3.connect(DB_NAME)
    c = conn.cursor()
    c.execute('''
        INSERT INTO requests (user_id, username, first_name, message)
        VALUES (?, ?, ?, ?)
    ''', (user_id, username, first_name, message_text))
    conn.commit()
    conn.close()

faq = {
    "Как оформить заказ?": 
        "Для оформления заказа, пожалуйста, выберите интересующий вас товар и нажмите кнопку Добавить в корзину, затем перейдите в корзину и следуйте инструкциям для завершения покупки.",

    "Как узнать статус моего заказа?": 
        "Вы можете узнать статус вашего заказа, войдя в свой аккаунт на нашем сайте и перейдя в раздел Мои заказы. Там будет указан текущий статус вашего заказа.",

    "Как отменить заказ?": 
        "Если вы хотите отменить заказ, пожалуйста, свяжитесь с нашей службой поддержки как можно скорее. Мы постараемся помочь вам с отменой заказа до его отправки.",

    "Что делать, если товар пришел поврежденным?": 
        "При получении поврежденного товара, пожалуйста, сразу свяжитесь с нашей службой поддержки и предоставьте фотографии повреждений. Мы поможем вам с обменом или возвратом товара",

    "Как связаться с вашей технической поддержкой?": 
        "Вы можете связаться с нашей технической поддержкой через телефон на нашем сайте или написать нам в чат-бота.",

    "Как узнать информацию о доставке?": 
        "Информацию о доставке вы можете найти на странице оформления заказа на нашем сайте. Там указаны доступные способы доставки и сроки."
}

def main_keyboard():
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=2)
    markup.add("❓ Задать вопрос")
    markup.add("📩 Написать специалисту")
    return markup

def faq_keyboard():
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True, row_width=1)
    for q in faq:
        markup.add(q)
    markup.add("← Назад")
    return markup

def back_keyboard():
    markup = types.ReplyKeyboardMarkup(resize_keyboard=True)
    markup.add("← Назад")
    return markup
